smachin1000/thread_nxp/FSL_Thread_Stack_0.6.0/KSDK/platform/CMSIS/Include/device/MK21DA5/MK21DA5_registers.h
/*! @brief Format value for bitfield AIPS_PACRP_SP0. */
#define BF_AIPS_PACRP_SP0(v) ((uint32_t)((uint32_t)(v) << BP_AIPS_PACRP_SP0) & BM_AIPS_PACRP_SP0)

/*! @brief Set the SP0 field to a new value. */
#define BW_AIPS_PACRP_SP0(x, v) (BITBAND_ACCESS32(HW_AIPS_PACRP_ADDR(x), BP_AIPS_PACRP_SP0) = (v))
/*@}*/

/*******************************************************************************
 * hw_aips_t - module struct
 ******************************************************************************/
/*!
 * @brief All AIPS module registers.
 */
#pragma pack(1)
typedef struct _hw_aips
{
    __IO hw_aips_mpra_t MPRA;              /*!< [0x0] Master Privilege Register A */
    uint8_t _reserved0[28];
    __IO hw_aips_pacra_t PACRA;            /*!< [0x20] Peripheral Access Control Register */
    __IO hw_aips_pacrb_t PACRB;            /*!< [0x24] Peripheral Access Control Register */
    __IO hw_aips_pacrc_t PACRC;            /*!< [0x28] Peripheral Access Control Register */
    __IO hw_aips_pacrd_t PACRD;            /*!< [0x2C] Peripheral Access Control Register */
    uint8_t _reserved1[16];
    __IO hw_aips_pacre_t PACRE;            /*!< [0x40] Peripheral Access Control Register */
    __IO hw_aips_pacrf_t PACRF;            /*!< [0x44] Peripheral Access Control Register */
    __IO hw_aips_pacrg_t PACRG;            /*!< [0x48] Peripheral Access Control Register */
    __IO hw_aips_pacrh_t PACRH;            /*!< [0x4C] Peripheral Access Control Register */
    __IO hw_aips_pacri_t PACRI;            /*!< [0x50] Peripheral Access Control Register */
    __IO hw_aips_pacrj_t PACRJ;            /*!< [0x54] Peripheral Access Control Register */
    __IO hw_aips_pacrk_t PACRK;            /*!< [0x58] Peripheral Access Control Register */
    __IO hw_aips_pacrl_t PACRL;            /*!< [0x5C] Peripheral Access Control Register */
    __IO hw_aips_pacrm_t PACRM;            /*!< [0x60] Peripheral Access Control Register */
    __IO hw_aips_pacrn_t PACRN;            /*!< [0x64] Peripheral Access Control Register */
    __IO hw_aips_pacro_t PACRO;            /*!< [0x68] Peripheral Access Control Register */
    __IO hw_aips_pacrp_t PACRP;            /*!< [0x6C] Peripheral Access Control Register */
} hw_aips_t;
#pragma pack()

/*! @brief Macro to access all AIPS registers. */
/*! @param x AIPS module instance base address. */
/*! @return Reference (not a pointer) to the registers struct. To get a pointer to the struct,
 *     use the '&' operator, like <code>&HW_AIPS_REGS(AIPS0_BASE)</code>. */
#define HW_AIPS_REGS(x) (*(hw_aips_t *)(x))

/*
 * MK21DA5 CAU
 *
 * Memory Mapped Cryptographic Acceleration Unit (MMCAU)
 *
 * Registers defined in this header file:
 * - HW_CAU_DIRECT0 - Direct access register 0
 * - HW_CAU_DIRECT1 - Direct access register 1
 * - HW_CAU_DIRECT2 - Direct access register 2
 * - HW_CAU_DIRECT3 - Direct access register 3
 * - HW_CAU_DIRECT4 - Direct access register 4
 * - HW_CAU_DIRECT5 - Direct access register 5
 * - HW_CAU_DIRECT6 - Direct access register 6
 * - HW_CAU_DIRECT7 - Direct access register 7
 * - HW_CAU_DIRECT8 - Direct access register 8
 * - HW_CAU_DIRECT9 - Direct access register 9
 * - HW_CAU_DIRECT10 - Direct access register 10
 * - HW_CAU_DIRECT11 - Direct access register 11
 * - HW_CAU_DIRECT12 - Direct access register 12
 * - HW_CAU_DIRECT13 - Direct access register 13
 * - HW_CAU_DIRECT14 - Direct access register 14
 * - HW_CAU_DIRECT15 - Direct access register 15
 * - HW_CAU_LDR_CASR - Status register  - Load Register command
 * - HW_CAU_LDR_CAA - Accumulator register - Load Register command
 * - HW_CAU_LDR_CA0 - General Purpose Register 0 - Load Register command
 * - HW_CAU_LDR_CA1 - General Purpose Register 1 - Load Register command
 * - HW_CAU_LDR_CA2 - General Purpose Register 2 - Load Register command
 * - HW_CAU_LDR_CA3 - General Purpose Register 3 - Load Register command
 * - HW_CAU_LDR_CA4 - General Purpose Register 4 - Load Register command
 * - HW_CAU_LDR_CA5 - General Purpose Register 5 - Load Register command
 * - HW_CAU_LDR_CA6 - General Purpose Register 6 - Load Register command
 * - HW_CAU_LDR_CA7 - General Purpose Register 7 - Load Register command
 * - HW_CAU_LDR_CA8 - General Purpose Register 8 - Load Register command
 * - HW_CAU_STR_CASR - Status register  - Store Register command
 * - HW_CAU_STR_CAA - Accumulator register - Store Register command
 * - HW_CAU_STR_CA0 - General Purpose Register 0 - Store Register command
 * - HW_CAU_STR_CA1 - General Purpose Register 1 - Store Register command
 * - HW_CAU_STR_CA2 - General Purpose Register 2 - Store Register command
 * - HW_CAU_STR_CA3 - General Purpose Register 3 - Store Register command
 * - HW_CAU_STR_CA4 - General Purpose Register 4 - Store Register command
 * - HW_CAU_STR_CA5 - General Purpose Register 5 - Store Register command
 * - HW_CAU_STR_CA6 - General Purpose Register 6 - Store Register command
 * - HW_CAU_STR_CA7 - General Purpose Register 7 - Store Register command
 * - HW_CAU_STR_CA8 - General Purpose Register 8 - Store Register command
 * - HW_CAU_ADR_CASR - Status register  - Add Register command
 * - HW_CAU_ADR_CAA - Accumulator register - Add to register command
 * - HW_CAU_ADR_CA0 - General Purpose Register 0 - Add to register command
 * - HW_CAU_ADR_CA1 - General Purpose Register 1 - Add to register command
 * - HW_CAU_ADR_CA2 - General Purpose Register 2 - Add to register command
 * - HW_CAU_ADR_CA3 - General Purpose Register 3 - Add to register command
 * - HW_CAU_ADR_CA4 - General Purpose Register 4 - Add to register command
 * - HW_CAU_ADR_CA5 - General Purpose Register 5 - Add to register command
 * - HW_CAU_ADR_CA6 - General Purpose Register 6 - Add to register command
 * - HW_CAU_ADR_CA7 - General Purpose Register 7 - Add to register command
 * - HW_CAU_ADR_CA8 - General Purpose Register 8 - Add to register command
 * - HW_CAU_RADR_CASR - Status register  - Reverse and Add to Register command
 * - HW_CAU_RADR_CAA - Accumulator register - Reverse and Add to Register command
 * - HW_CAU_RADR_CA0 - General Purpose Register 0 - Reverse and Add to Register command
 * - HW_CAU_RADR_CA1 - General Purpose Register 1 - Reverse and Add to Register command
 * - HW_CAU_RADR_CA2 - General Purpose Register 2 - Reverse and Add to Register command
 * - HW_CAU_RADR_CA3 - General Purpose Register 3 - Reverse and Add to Register command
 * - HW_CAU_RADR_CA4 - General Purpose Register 4 - Reverse and Add to Register command
 * - HW_CAU_RADR_CA5 - General Purpose Register 5 - Reverse and Add to Register command
 * - HW_CAU_RADR_CA6 - General Purpose Register 6 - Reverse and Add to Register command
 * - HW_CAU_RADR_CA7 - General Purpose Register 7 - Reverse and Add to Register command
 * - HW_CAU_RADR_CA8 - General Purpose Register 8 - Reverse and Add to Register command
 * - HW_CAU_XOR_CASR - Status register  - Exclusive Or command
 * - HW_CAU_XOR_CAA - Accumulator register - Exclusive Or command
 * - HW_CAU_XOR_CA0 - General Purpose Register 0 - Exclusive Or command
 * - HW_CAU_XOR_CA1 - General Purpose Register 1 - Exclusive Or command
 * - HW_CAU_XOR_CA2 - General Purpose Register 2 - Exclusive Or command
 * - HW_CAU_XOR_CA3 - General Purpose Register 3 - Exclusive Or command
 * - HW_CAU_XOR_CA4 - General Purpose Register 4 - Exclusive Or command
 * - HW_CAU_XOR_CA5 - General Purpose Register 5 - Exclusive Or command
 * - HW_CAU_XOR_CA6 - General Purpose Register 6 - Exclusive Or command
 * - HW_CAU_XOR_CA7 - General Purpose Register 7 - Exclusive Or command
 * - HW_CAU_XOR_CA8 - General Purpose Register 8 - Exclusive Or command
 * - HW_CAU_ROTL_CASR - Status register  - Rotate Left command
 * - HW_CAU_ROTL_CAA - Accumulator register - Rotate Left command
 * - HW_CAU_ROTL_CA0 - General Purpose Register 0 - Rotate Left command
 * - HW_CAU_ROTL_CA1 - General Purpose Register 1 - Rotate Left command
 * - HW_CAU_ROTL_CA2 - General Purpose Register 2 - Rotate Left command
 * - HW_CAU_ROTL_CA3 - General Purpose Register 3 - Rotate Left command
 * - HW_CAU_ROTL_CA4 - General Purpose Register 4 - Rotate Left command
 * - HW_CAU_ROTL_CA5 - General Purpose Register 5 - Rotate Left command
 * - HW_CAU_ROTL_CA6 - General Purpose Register 6 - Rotate Left command
 * - HW_CAU_ROTL_CA7 - General Purpose Register 7 - Rotate Left command
 * - HW_CAU_ROTL_CA8 - General Purpose Register 8 - Rotate Left command
 * - HW_CAU_AESC_CASR - Status register  - AES Column Operation command
 * - HW_CAU_AESC_CAA - Accumulator register - AES Column Operation command
 * - HW_CAU_AESC_CA0 - General Purpose Register 0 - AES Column Operation command
 * - HW_CAU_AESC_CA1 - General Purpose Register 1 - AES Column Operation command
 * - HW_CAU_AESC_CA2 - General Purpose Register 2 - AES Column Operation command
 * - HW_CAU_AESC_CA3 - General Purpose Register 3 - AES Column Operation command
 * - HW_CAU_AESC_CA4 - General Purpose Register 4 - AES Column Operation command
 * - HW_CAU_AESC_CA5 - General Purpose Register 5 - AES Column Operation command
 * - HW_CAU_AESC_CA6 - General Purpose Register 6 - AES Column Operation command
 * - HW_CAU_AESC_CA7 - General Purpose Register 7 - AES Column Operation command
 * - HW_CAU_AESC_CA8 - General Purpose Register 8 - AES Column Operation command
 * - HW_CAU_AESIC_CASR - Status register  - AES Inverse Column Operation command
 * - HW_CAU_AESIC_CAA - Accumulator register - AES Inverse Column Operation command
 * - HW_CAU_AESIC_CA0 - General Purpose Register 0 - AES Inverse Column Operation command
 * - HW_CAU_AESIC_CA1 - General Purpose Register 1 - AES Inverse Column Operation command
 * - HW_CAU_AESIC_CA2 - General Purpose Register 2 - AES Inverse Column Operation command
 * - HW_CAU_AESIC_CA3 - General Purpose Register 3 - AES Inverse Column Operation command
 * - HW_CAU_AESIC_CA4 - General Purpose Register 4 - AES Inverse Column Operation command
 * - HW_CAU_AESIC_CA5 - General Purpose Register 5 - AES Inverse Column Operation command
 * - HW_CAU_AESIC_CA6 - General Purpose Register 6 - AES Inverse Column Operation command
 * - HW_CAU_AESIC_CA7 - General Purpose Register 7 - AES Inverse Column Operation command
 * - HW_CAU_AESIC_CA8 - General Purpose Register 8 - AES Inverse Column Operation command
 *
 * - hw_cau_t - Struct containing all module registers.
 */

#define HW_CAU_INSTANCE_COUNT (1U) /*!< Number of instances of the CAU module. */
#define HW_CAU (0U) /*!< Instance number for CAU. */

