smachin1000/thread_nxp/FSL_Thread_Stack_0.6.0/KSDK/platform/CMSIS/Include/device/MK21DA5/MK21DA5_registers.h
/*! @brief Read current value of the FTFL_FSEC_SEC field. */
#define BR_FTFL_FSEC_SEC(x)  (HW_FTFL_FSEC(x).B.SEC)
/*@}*/

/*!
 * @name Register FTFL_FSEC, field FSLACC[3:2] (RO)
 *
 * Enables or disables access to the flash memory contents during returned part
 * failure analysis at Freescale. When SEC is secure and FSLACC is denied, access
 * to the program flash contents is denied and any failure analysis performed by
 * Freescale factory test must begin with a full erase to unsecure the part.
 * When access is granted (SEC is unsecure, or SEC is secure and FSLACC is granted),
 * Freescale factory testing has visibility of the current flash contents. The
 * state of the FSLACC bits is only relevant when SEC is set to secure. When SEC
 * is set to unsecure, the FSLACC setting does not matter.
 *
 * Values:
 * - 00 - Freescale factory access granted
 * - 01 - Freescale factory access denied
 * - 10 - Freescale factory access denied
 * - 11 - Freescale factory access granted
 */
/*@{*/
#define BP_FTFL_FSEC_FSLACC  (2U)          /*!< Bit position for FTFL_FSEC_FSLACC. */
#define BM_FTFL_FSEC_FSLACC  (0x0CU)       /*!< Bit mask for FTFL_FSEC_FSLACC. */
#define BS_FTFL_FSEC_FSLACC  (2U)          /*!< Bit field size in bits for FTFL_FSEC_FSLACC. */

/*! @brief Read current value of the FTFL_FSEC_FSLACC field. */
#define BR_FTFL_FSEC_FSLACC(x) (HW_FTFL_FSEC(x).B.FSLACC)
/*@}*/

/*!
 * @name Register FTFL_FSEC, field MEEN[5:4] (RO)
 *
 * Enables and disables mass erase capability of the flash memory module. The
 * state of this field is relevant only when SEC is set to secure outside of NVM
 * Normal Mode. When SEC is set to unsecure, the MEEN setting does not matter.
 *
 * Values:
 * - 00 - Mass erase is enabled
 * - 01 - Mass erase is enabled
 * - 10 - Mass erase is disabled
 * - 11 - Mass erase is enabled
 */
/*@{*/
#define BP_FTFL_FSEC_MEEN    (4U)          /*!< Bit position for FTFL_FSEC_MEEN. */
#define BM_FTFL_FSEC_MEEN    (0x30U)       /*!< Bit mask for FTFL_FSEC_MEEN. */
#define BS_FTFL_FSEC_MEEN    (2U)          /*!< Bit field size in bits for FTFL_FSEC_MEEN. */

/*! @brief Read current value of the FTFL_FSEC_MEEN field. */
#define BR_FTFL_FSEC_MEEN(x) (HW_FTFL_FSEC(x).B.MEEN)
/*@}*/

/*!
 * @name Register FTFL_FSEC, field KEYEN[7:6] (RO)
 *
 * Enables or disables backdoor key access to the flash memory module.
 *
 * Values:
 * - 00 - Backdoor key access disabled
 * - 01 - Backdoor key access disabled (preferred KEYEN state to disable
 *     backdoor key access)
 * - 10 - Backdoor key access enabled
 * - 11 - Backdoor key access disabled
 */
/*@{*/
#define BP_FTFL_FSEC_KEYEN   (6U)          /*!< Bit position for FTFL_FSEC_KEYEN. */
#define BM_FTFL_FSEC_KEYEN   (0xC0U)       /*!< Bit mask for FTFL_FSEC_KEYEN. */
#define BS_FTFL_FSEC_KEYEN   (2U)          /*!< Bit field size in bits for FTFL_FSEC_KEYEN. */

/*! @brief Read current value of the FTFL_FSEC_KEYEN field. */
#define BR_FTFL_FSEC_KEYEN(x) (HW_FTFL_FSEC(x).B.KEYEN)
/*@}*/

/*******************************************************************************
 * HW_FTFL_FOPT - Flash Option Register
 ******************************************************************************/

/*!
 * @brief HW_FTFL_FOPT - Flash Option Register (RO)
 *
 * Reset value: 0x00U
 *
 * The flash option register allows the MCU to customize its operations by
 * examining the state of these read-only bits, which are loaded from NVM at reset.
 * The function of the bits is defined in the device's Chip Configuration details.
 * All bits in the register are read-only . During the reset sequence, the
 * register is loaded from the flash nonvolatile option byte in the Flash Configuration
 * Field located in program flash memory. The flash basis for the values is
 * signified by X in the reset value.
 */
typedef union _hw_ftfl_fopt
{
    uint8_t U;
    struct _hw_ftfl_fopt_bitfields
    {
        uint8_t OPT : 8;               /*!< [7:0] Nonvolatile Option */
    } B;
} hw_ftfl_fopt_t;

/*!
 * @name Constants and macros for entire FTFL_FOPT register
 */
/*@{*/
#define HW_FTFL_FOPT_ADDR(x)     ((uintptr_t)(x) + 0x3U)

#define HW_FTFL_FOPT(x)          (*(__I hw_ftfl_fopt_t *) HW_FTFL_FOPT_ADDR(x))
#define HW_FTFL_FOPT_RD(x)       (HW_FTFL_FOPT(x).U)
/*@}*/

/*
 * Constants & macros for individual FTFL_FOPT bitfields
 */

/*!
 * @name Register FTFL_FOPT, field OPT[7:0] (RO)
 *
 * These bits are loaded from flash to this register at reset. Refer to the
 * device's Chip Configuration details for the definition and use of these bits.
 */
/*@{*/
#define BP_FTFL_FOPT_OPT     (0U)          /*!< Bit position for FTFL_FOPT_OPT. */
#define BM_FTFL_FOPT_OPT     (0xFFU)       /*!< Bit mask for FTFL_FOPT_OPT. */
#define BS_FTFL_FOPT_OPT     (8U)          /*!< Bit field size in bits for FTFL_FOPT_OPT. */

/*! @brief Read current value of the FTFL_FOPT_OPT field. */
#define BR_FTFL_FOPT_OPT(x)  (HW_FTFL_FOPT(x).U)
/*@}*/

/*******************************************************************************
 * HW_FTFL_FCCOB3 - Flash Common Command Object Registers
 ******************************************************************************/

/*!
 * @brief HW_FTFL_FCCOB3 - Flash Common Command Object Registers (RW)
 *
 * Reset value: 0x00U
 *
 * The FCCOB register group provides 12 bytes for command codes and parameters.
 * The individual bytes within the set append a 0-B hex identifier to the FCCOB
 * register name: FCCOB0, FCCOB1, ..., FCCOBB.
 */
typedef union _hw_ftfl_fccob3
{
    uint8_t U;
    struct _hw_ftfl_fccob3_bitfields
    {
        uint8_t CCOBn : 8;             /*!< [7:0]  */
    } B;
} hw_ftfl_fccob3_t;

/*!
 * @name Constants and macros for entire FTFL_FCCOB3 register
 */
/*@{*/
#define HW_FTFL_FCCOB3_ADDR(x)   ((uintptr_t)(x) + 0x4U)

#define HW_FTFL_FCCOB3(x)        (*(__IO hw_ftfl_fccob3_t *) HW_FTFL_FCCOB3_ADDR(x))
#define HW_FTFL_FCCOB3_RD(x)     (HW_FTFL_FCCOB3(x).U)
#define HW_FTFL_FCCOB3_WR(x, v)  (HW_FTFL_FCCOB3(x).U = (v))
#define HW_FTFL_FCCOB3_SET(x, v) (HW_FTFL_FCCOB3_WR(x, HW_FTFL_FCCOB3_RD(x) |  (v)))
#define HW_FTFL_FCCOB3_CLR(x, v) (HW_FTFL_FCCOB3_WR(x, HW_FTFL_FCCOB3_RD(x) & ~(v)))
#define HW_FTFL_FCCOB3_TOG(x, v) (HW_FTFL_FCCOB3_WR(x, HW_FTFL_FCCOB3_RD(x) ^  (v)))
/*@}*/

