smachin1000/thread_nxp/FSL_Thread_Stack_0.6.0/KSDK/platform/CMSIS/Include/device/MK21DA5/MK21DA5_registers.h
/*! @brief Format value for bitfield FTFL_FPROT3_PROT. */
#define BF_FTFL_FPROT3_PROT(v) ((uint8_t)((uint8_t)(v) << BP_FTFL_FPROT3_PROT) & BM_FTFL_FPROT3_PROT)

/*! @brief Set the PROT field to a new value. */
#define BW_FTFL_FPROT3_PROT(x, v) (HW_FTFL_FPROT3_WR(x, v))
/*@}*/

/*******************************************************************************
 * HW_FTFL_FPROT2 - Program Flash Protection Registers
 ******************************************************************************/

/*!
 * @brief HW_FTFL_FPROT2 - Program Flash Protection Registers (RW)
 *
 * Reset value: 0x00U
 *
 * The FPROT registers define which program flash regions are protected from
 * program and erase operations. Protected flash regions cannot have their content
 * changed; that is, these regions cannot be programmed and cannot be erased by
 * any flash command. Unprotected regions can be changed by program and erase
 * operations. The four FPROT registers allow 32 protectable regions. Each bit
 * protects a 1/32 region of the program flash memory . The bitfields are defined in
 * each register as follows: Program flash protection register Program flash
 * protection bits FPROT0 PROT[31:24] FPROT1 PROT[23:16] FPROT2 PROT[15:8] FPROT3
 * PROT[7:0] During the reset sequence, the FPROT registers are loaded with the
 * contents of the program flash protection bytes in the Flash Configuration Field as
 * indicated in the following table. Program flash protection register Flash
 * Configuration Field offset address FPROT0 0x000B FPROT1 0x000A FPROT2 0x0009 FPROT3
 * 0x0008 To change the program flash protection that is loaded during the reset
 * sequence, unprotect the sector of program flash memory that contains the Flash
 * Configuration Field. Then, reprogram the program flash protection byte.
 */
typedef union _hw_ftfl_fprot2
{
    uint8_t U;
    struct _hw_ftfl_fprot2_bitfields
    {
        uint8_t PROT : 8;              /*!< [7:0] Program Flash Region Protect */
    } B;
} hw_ftfl_fprot2_t;

/*!
 * @name Constants and macros for entire FTFL_FPROT2 register
 */
/*@{*/
#define HW_FTFL_FPROT2_ADDR(x)   ((uintptr_t)(x) + 0x11U)

#define HW_FTFL_FPROT2(x)        (*(__IO hw_ftfl_fprot2_t *) HW_FTFL_FPROT2_ADDR(x))
#define HW_FTFL_FPROT2_RD(x)     (HW_FTFL_FPROT2(x).U)
#define HW_FTFL_FPROT2_WR(x, v)  (HW_FTFL_FPROT2(x).U = (v))
#define HW_FTFL_FPROT2_SET(x, v) (HW_FTFL_FPROT2_WR(x, HW_FTFL_FPROT2_RD(x) |  (v)))
#define HW_FTFL_FPROT2_CLR(x, v) (HW_FTFL_FPROT2_WR(x, HW_FTFL_FPROT2_RD(x) & ~(v)))
#define HW_FTFL_FPROT2_TOG(x, v) (HW_FTFL_FPROT2_WR(x, HW_FTFL_FPROT2_RD(x) ^  (v)))
/*@}*/

/*
 * Constants & macros for individual FTFL_FPROT2 bitfields
 */

/*!
 * @name Register FTFL_FPROT2, field PROT[7:0] (RW)
 *
 * Each program flash region can be protected from program and erase operations
 * by setting the associated PROT bit. In NVM Normal mode: The protection can
 * only be increased, meaning that currently unprotected memory can be protected,
 * but currently protected memory cannot be unprotected. Since unprotected regions
 * are marked with a 1 and protected regions use a 0, only writes changing 1s to
 * 0s are accepted. This 1-to-0 transition check is performed on a bit-by-bit
 * basis. Those FPROT bits with 1-to-0 transitions are accepted while all bits with
 * 0-to-1 transitions are ignored. In NVM Special mode: All bits of FPROT are
 * writable without restriction. Unprotected areas can be protected and protected
 * areas can be unprotected. The user must never write to any FPROT register while
 * a command is running (CCIF=0). Trying to alter data in any protected area in
 * the program flash memory results in a protection violation error and sets the
 * FSTAT[FPVIOL] bit. A full block erase of a program flash block is not possible
 * if it contains any protected region. Each bit in the 32-bit protection
 * register represents 1/32 of the total program flash.
 *
 * Values:
 * - 0 - Program flash region is protected.
 * - 1 - Program flash region is not protected
 */
/*@{*/
#define BP_FTFL_FPROT2_PROT  (0U)          /*!< Bit position for FTFL_FPROT2_PROT. */
#define BM_FTFL_FPROT2_PROT  (0xFFU)       /*!< Bit mask for FTFL_FPROT2_PROT. */
#define BS_FTFL_FPROT2_PROT  (8U)          /*!< Bit field size in bits for FTFL_FPROT2_PROT. */

/*! @brief Read current value of the FTFL_FPROT2_PROT field. */
#define BR_FTFL_FPROT2_PROT(x) (HW_FTFL_FPROT2(x).U)

/*! @brief Format value for bitfield FTFL_FPROT2_PROT. */
#define BF_FTFL_FPROT2_PROT(v) ((uint8_t)((uint8_t)(v) << BP_FTFL_FPROT2_PROT) & BM_FTFL_FPROT2_PROT)

/*! @brief Set the PROT field to a new value. */
#define BW_FTFL_FPROT2_PROT(x, v) (HW_FTFL_FPROT2_WR(x, v))
/*@}*/

/*******************************************************************************
 * HW_FTFL_FPROT1 - Program Flash Protection Registers
 ******************************************************************************/

/*!
 * @brief HW_FTFL_FPROT1 - Program Flash Protection Registers (RW)
 *
 * Reset value: 0x00U
 *
 * The FPROT registers define which program flash regions are protected from
 * program and erase operations. Protected flash regions cannot have their content
 * changed; that is, these regions cannot be programmed and cannot be erased by
 * any flash command. Unprotected regions can be changed by program and erase
 * operations. The four FPROT registers allow 32 protectable regions. Each bit
 * protects a 1/32 region of the program flash memory . The bitfields are defined in
 * each register as follows: Program flash protection register Program flash
 * protection bits FPROT0 PROT[31:24] FPROT1 PROT[23:16] FPROT2 PROT[15:8] FPROT3
 * PROT[7:0] During the reset sequence, the FPROT registers are loaded with the
 * contents of the program flash protection bytes in the Flash Configuration Field as
 * indicated in the following table. Program flash protection register Flash
 * Configuration Field offset address FPROT0 0x000B FPROT1 0x000A FPROT2 0x0009 FPROT3
 * 0x0008 To change the program flash protection that is loaded during the reset
 * sequence, unprotect the sector of program flash memory that contains the Flash
 * Configuration Field. Then, reprogram the program flash protection byte.
 */
typedef union _hw_ftfl_fprot1
{
    uint8_t U;
    struct _hw_ftfl_fprot1_bitfields
    {
        uint8_t PROT : 8;              /*!< [7:0] Program Flash Region Protect */
    } B;
} hw_ftfl_fprot1_t;

/*!
 * @name Constants and macros for entire FTFL_FPROT1 register
 */
/*@{*/
#define HW_FTFL_FPROT1_ADDR(x)   ((uintptr_t)(x) + 0x12U)

