smachin1000/thread_nxp/FSL_Thread_Stack_0.6.0/KSDK/platform/CMSIS/Include/device/MK21DA5/MK21DA5_registers.h
/*! @brief Format value for bitfield RTC_IER_TOIE. */
#define BF_RTC_IER_TOIE(v)   ((uint32_t)((uint32_t)(v) << BP_RTC_IER_TOIE) & BM_RTC_IER_TOIE)

/*! @brief Set the TOIE field to a new value. */
#define BW_RTC_IER_TOIE(x, v) (BITBAND_ACCESS32(HW_RTC_IER_ADDR(x), BP_RTC_IER_TOIE) = (v))
/*@}*/

/*!
 * @name Register RTC_IER, field TAIE[2] (RW)
 *
 * Values:
 * - 0 - Time alarm flag does not generate an interrupt.
 * - 1 - Time alarm flag does generate an interrupt.
 */
/*@{*/
#define BP_RTC_IER_TAIE      (2U)          /*!< Bit position for RTC_IER_TAIE. */
#define BM_RTC_IER_TAIE      (0x00000004U) /*!< Bit mask for RTC_IER_TAIE. */
#define BS_RTC_IER_TAIE      (1U)          /*!< Bit field size in bits for RTC_IER_TAIE. */

/*! @brief Read current value of the RTC_IER_TAIE field. */
#define BR_RTC_IER_TAIE(x)   (BITBAND_ACCESS32(HW_RTC_IER_ADDR(x), BP_RTC_IER_TAIE))

/*! @brief Format value for bitfield RTC_IER_TAIE. */
#define BF_RTC_IER_TAIE(v)   ((uint32_t)((uint32_t)(v) << BP_RTC_IER_TAIE) & BM_RTC_IER_TAIE)

/*! @brief Set the TAIE field to a new value. */
#define BW_RTC_IER_TAIE(x, v) (BITBAND_ACCESS32(HW_RTC_IER_ADDR(x), BP_RTC_IER_TAIE) = (v))
/*@}*/

/*!
 * @name Register RTC_IER, field MOIE[3] (RW)
 *
 * Values:
 * - 0 - Monotonic overflow flag does not generate an interrupt.
 * - 1 - Monotonic overflow flag does generate an interrupt.
 */
/*@{*/
#define BP_RTC_IER_MOIE      (3U)          /*!< Bit position for RTC_IER_MOIE. */
#define BM_RTC_IER_MOIE      (0x00000008U) /*!< Bit mask for RTC_IER_MOIE. */
#define BS_RTC_IER_MOIE      (1U)          /*!< Bit field size in bits for RTC_IER_MOIE. */

/*! @brief Read current value of the RTC_IER_MOIE field. */
#define BR_RTC_IER_MOIE(x)   (BITBAND_ACCESS32(HW_RTC_IER_ADDR(x), BP_RTC_IER_MOIE))

/*! @brief Format value for bitfield RTC_IER_MOIE. */
#define BF_RTC_IER_MOIE(v)   ((uint32_t)((uint32_t)(v) << BP_RTC_IER_MOIE) & BM_RTC_IER_MOIE)

/*! @brief Set the MOIE field to a new value. */
#define BW_RTC_IER_MOIE(x, v) (BITBAND_ACCESS32(HW_RTC_IER_ADDR(x), BP_RTC_IER_MOIE) = (v))
/*@}*/

/*!
 * @name Register RTC_IER, field TSIE[4] (RW)
 *
 * The seconds interrupt is an edge-sensitive interrupt with a dedicated
 * interrupt vector. It is generated once a second and requires no software overhead
 * (there is no corresponding status flag to clear).
 *
 * Values:
 * - 0 - Seconds interrupt is disabled.
 * - 1 - Seconds interrupt is enabled.
 */
/*@{*/
#define BP_RTC_IER_TSIE      (4U)          /*!< Bit position for RTC_IER_TSIE. */
#define BM_RTC_IER_TSIE      (0x00000010U) /*!< Bit mask for RTC_IER_TSIE. */
#define BS_RTC_IER_TSIE      (1U)          /*!< Bit field size in bits for RTC_IER_TSIE. */

/*! @brief Read current value of the RTC_IER_TSIE field. */
#define BR_RTC_IER_TSIE(x)   (BITBAND_ACCESS32(HW_RTC_IER_ADDR(x), BP_RTC_IER_TSIE))

/*! @brief Format value for bitfield RTC_IER_TSIE. */
#define BF_RTC_IER_TSIE(v)   ((uint32_t)((uint32_t)(v) << BP_RTC_IER_TSIE) & BM_RTC_IER_TSIE)

/*! @brief Set the TSIE field to a new value. */
#define BW_RTC_IER_TSIE(x, v) (BITBAND_ACCESS32(HW_RTC_IER_ADDR(x), BP_RTC_IER_TSIE) = (v))
/*@}*/

/*!
 * @name Register RTC_IER, field WPON[7] (RW)
 *
 * The wakeup pin is optional and not available on all devices. Whenever the
 * wakeup pin is enabled and this bit is set, the wakeup pin will assert.
 *
 * Values:
 * - 0 - No effect.
 * - 1 - If the wakeup pin is enabled, then the wakeup pin will assert.
 */
/*@{*/
#define BP_RTC_IER_WPON      (7U)          /*!< Bit position for RTC_IER_WPON. */
#define BM_RTC_IER_WPON      (0x00000080U) /*!< Bit mask for RTC_IER_WPON. */
#define BS_RTC_IER_WPON      (1U)          /*!< Bit field size in bits for RTC_IER_WPON. */

/*! @brief Read current value of the RTC_IER_WPON field. */
#define BR_RTC_IER_WPON(x)   (BITBAND_ACCESS32(HW_RTC_IER_ADDR(x), BP_RTC_IER_WPON))

/*! @brief Format value for bitfield RTC_IER_WPON. */
#define BF_RTC_IER_WPON(v)   ((uint32_t)((uint32_t)(v) << BP_RTC_IER_WPON) & BM_RTC_IER_WPON)

/*! @brief Set the WPON field to a new value. */
#define BW_RTC_IER_WPON(x, v) (BITBAND_ACCESS32(HW_RTC_IER_ADDR(x), BP_RTC_IER_WPON) = (v))
/*@}*/

/*******************************************************************************
 * HW_RTC_TTSR - RTC Tamper Time Seconds Register
 ******************************************************************************/

/*!
 * @brief HW_RTC_TTSR - RTC Tamper Time Seconds Register (RO)
 *
 * Reset value: 0x00000000U
 */
typedef union _hw_rtc_ttsr
{
    uint32_t U;
    struct _hw_rtc_ttsr_bitfields
    {
        uint32_t TTS : 32;             /*!< [31:0] Tamper Time Seconds */
    } B;
} hw_rtc_ttsr_t;

/*!
 * @name Constants and macros for entire RTC_TTSR register
 */
/*@{*/
#define HW_RTC_TTSR_ADDR(x)      ((uintptr_t)(x) + 0x20U)

#define HW_RTC_TTSR(x)           (*(__I hw_rtc_ttsr_t *) HW_RTC_TTSR_ADDR(x))
#define HW_RTC_TTSR_RD(x)        (HW_RTC_TTSR(x).U)
/*@}*/

/*
 * Constants & macros for individual RTC_TTSR bitfields
 */

/*!
 * @name Register RTC_TTSR, field TTS[31:0] (RO)
 *
 * If the time invalid flag is set then reading this register returns the
 * contents of the time seconds register at the point at which the time invalid flag
 * was set. If the time invalid flag is clear then reading this register returns
 * zero. Writing the tamper time seconds register with any value will set the time
 * invalid flag.
 */
/*@{*/
#define BP_RTC_TTSR_TTS      (0U)          /*!< Bit position for RTC_TTSR_TTS. */
#define BM_RTC_TTSR_TTS      (0xFFFFFFFFU) /*!< Bit mask for RTC_TTSR_TTS. */
#define BS_RTC_TTSR_TTS      (32U)         /*!< Bit field size in bits for RTC_TTSR_TTS. */

/*! @brief Read current value of the RTC_TTSR_TTS field. */
#define BR_RTC_TTSR_TTS(x)   (HW_RTC_TTSR(x).U)
/*@}*/

/*******************************************************************************
 * HW_RTC_MER - RTC Monotonic Enable Register
 ******************************************************************************/

/*!
 * @brief HW_RTC_MER - RTC Monotonic Enable Register (RW)
 *
 * Reset value: 0x00000000U
 */
typedef union _hw_rtc_mer
{
    uint32_t U;
    struct _hw_rtc_mer_bitfields
    {
        uint32_t RESERVED0 : 4;        /*!< [3:0]  */
        uint32_t MCE : 1;              /*!< [4] Monotonic Counter Enable */
        uint32_t RESERVED1 : 27;       /*!< [31:5]  */
    } B;
} hw_rtc_mer_t;

/*!
 * @name Constants and macros for entire RTC_MER register
 */
/*@{*/
#define HW_RTC_MER_ADDR(x)       ((uintptr_t)(x) + 0x24U)

#define HW_RTC_MER(x)            (*(__IO hw_rtc_mer_t *) HW_RTC_MER_ADDR(x))
#define HW_RTC_MER_RD(x)         (HW_RTC_MER(x).U)
#define HW_RTC_MER_WR(x, v)      (HW_RTC_MER(x).U = (v))
#define HW_RTC_MER_SET(x, v)     (HW_RTC_MER_WR(x, HW_RTC_MER_RD(x) |  (v)))
#define HW_RTC_MER_CLR(x, v)     (HW_RTC_MER_WR(x, HW_RTC_MER_RD(x) & ~(v)))
#define HW_RTC_MER_TOG(x, v)     (HW_RTC_MER_WR(x, HW_RTC_MER_RD(x) ^  (v)))
/*@}*/

